tigard-tools/circuitpython/ports/raspberrypi/boards/adafruit_metro_rp2040/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2021 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

#define MICROPY_HW_BOARD_NAME "Adafruit Metro RP2040"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO14)

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO17)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO16)

#define DEFAULT_SPI_BUS_SCK (&pin_GPIO18)
#define DEFAULT_SPI_BUS_MOSI (&pin_GPIO19)
#define DEFAULT_SPI_BUS_MISO (&pin_GPIO20)

#define DEFAULT_UART_BUS_RX (&pin_GPIO1)
#define DEFAULT_UART_BUS_TX (&pin_GPIO0)

// Onboard microSD slot.
#define DEFAULT_SD_SCK (&pin_GPIO18)
#define DEFAULT_SD_MOSI (&pin_GPIO19)
#define DEFAULT_SD_MISO (&pin_GPIO20)
#define DEFAULT_SD_CS (&pin_GPIO23)
#define DEFAULT_SD_CARD_DETECT (&pin_GPIO15)
#define DEFAULT_SD_CARD_INSERTED true
